Repository: Francesco146/nothanks
Catalog: locales/*/messages.po
Languages: it

# header.subtitle
source: Please, don't say thank you
it: Per favore, non dire grazie

# header.introduction
source: A thumbs-up is enough to say thank you... 👍
it: Un pollice in su basta e avanza per dire grazie... 👍

# example.character.neutral.avatar-description
source: Tim's Slack avatar
it: L'avatar su Slack di Tim

# example.character.bad.avatar-description
source: Keith's Slack avatar
it: L'avatar su Slack di Keith

# example.character.good.avatar-description
source: Dawn's Slack avatar
it: L'avatar su Slack di Dawn

# example.bad.title
source: ❌ Don't do this
it: ❌ Non farlo

# example.bad.body
source: Note that Keith and Tim could have avoided sending a third and fourth message. In fact, Keith, and later Tim, could have refrained from bothering the whole group with mutual thanks! People who act like this usually try to be polite, and the communicate as they would do in person or on the phone - and that's fine! But we're in %1$s, and the chat is neither. Most people don't want off-topic messages in their chat. So despite the best intentions, **you're basically filling the chat with unnecessary messages**, which is a waste of time (and a bit annoying). The same goes for: - "Thanks a lot!" - "thanksss" - "Thank you all" - "tysm" - "hey, thanks" - etc. **Use a reaction!** 😫
it: Nota che Keith e Tim avrebbe potuto evitare di inviare un terzo e quarto messaggio. Di fatto, Keith, e successivamente Tim, avrebbero potuto non disturbare tutto il gruppo per farsi i ringraziamenti a vicenda! Le persone che agiscono così tendenzialmente cercano di essere gentili evitando di risultare antipatici, come si fa di persona o al telefono - e questo va bene! Ma siamo nel %1$s e la chat non è ne l'uno né l'altro. La maggior parte della gente non vuole messaggi non inerenti nella propria chat. Per cui nonostante le migliori intenzioni, **stai fondamentalmente riempiendo la chat di messaggi superflui**, il che è tempo perso (e un po' fastidioso). Lo stesso si può dire per: - "Grazie mille davvero!" - "grazieeee" - "Vi ringrazio" - "tysm" - "oi, grazie eh" - etc. **Metti una reazione!** 😫

# example.bad.message1.body
source: hi, question: what time was that thing?
it: ciao, domanda: a che ora era quella cosa?

# example.bad.reply1.body
source: at 3:30
it: alle 3:30

# example.bad.message2.body
source: thanks! 😊
it: grazie! 😊

# example.good.title
source: ✅ Try this instead
it: ✅ Prova così invece

# example.good.body
source: If you think you're being rude by asking and simply saying "Thank you" later, **you can end your message with all the thanks you want.** For example: - "hey, how's it going? any idea about the deadline for that thing? thanks a lot" - "I hope everything is going well. I have a question, when you have a moment, thanks in advance" - "hey, if you're not busy, could you update the NFRs? Thanks" - etc. Thanking before the actual answer **avoids many other unnecessary thanks**, making you appear even more polite. If another person had the same question, reading your response would make them want to thank you. Bam, just use a reaction 👍 and it's all good. No unnecessary notifications. When it's a reaction - everyone is happy! 🎉
it: Se pensi di essere maleducato nel fare la domanda e dire semplicemente "Grazie", **puoi finire il tuo messaggio come tutti i ringraziamenti che vuoi.** Per esempio: - "ehi, come va? hai idea della scadenza per quella cosa? grazie mille" - "Spero che vada tutto bene. Ho una domanda, quando hai un secondo, grazie in anticipo" - "ehi, se non sei occupato, potresti aggiornare gli NFR? grazie" - etc. Può sembrare banale, ma fare i ringraziamenti prima della risposta **evita molti altri ringraziamenti**. Se un altro interlocutore avesse avuto la stessa domanda, leggendo la risposta vorrebbe poterti ringraziare. Bam, basta mettere la reazione 👍 e tutto risolto. Nessuna notifica superflua. Quando è una reazione - tutti sono contenti! 🎉

# example.good.message1.body
source: hey, what time was that thing? Thanks!
it: hey, a che ora era quella cosa? Grazie!

# example.good.reply1.body
source: hey, 3:30. You're welcome! :D
it: ehi, 3:30. Di nulla! :D

# example.good.reaction1
source: Dawn reacted with a thumbs-up!
it: Dawn ha reagito con un pollice in su!

# footer.note
source: All of this is only half serious (more or less 👀) so, please, don't [take it too seriously](https://www.youtube.com/watch?v=xzpndHtdl9A) with the person who sent you here.
it: Tutto questo è serio solo a metà (più o meno 👀) quindi, per favore, non [prendertela](https://www.youtube.com/watch?v=xzpndHtdl9A) con la persona che ti ha mandato qui.

# footer.thanks
source: Based on the wonderful [nohello.net](https://nohello.net/en/). Avatars are taken from *[The Office](https://en.wikipedia.org/wiki/The_Office_(British_TV_series))*. The code is available on [GitHub](https://github.com/Francesco146/nothanks).
it: Basato sul meraviglioso [nohello.net](https://nohello.net/it/). Gli avatar sono presi da *[The Office](https://it.wikipedia.org/wiki/The_Office_(serie_televisiva_2001))*. Il codice è disponibile su [GitHub](https://github.com/Francesco146/nothanks).

# footer.languages
source: This site is available in:
it: Questo sito è disponibile in:
